{
    "gallery": [
        {
            "img": "/images/gallery/img (1).jpeg",
            "text": "The Eat Right Station Certificate presentation ceremony was conducted at Kalaingar Centenary Super Speciality Hospital, Guindy, graced by the Hon'ble Health Minister. Unavar Food Inspection participated in this significant event, having conducted the Eat Right Station Certification Audit for Thiruvallur Railway Station and Avadi Railway Station. The event was also attended by officials from the Thiruvallur Food Safety Department. It was a moment of honor and recognition for our participation and contribution towards ensuring food safety and adherence to quality standards at these railway stations"
        },
        
        {
            "img": "/images/gallery/img (2).jpeg",
            "text": "At Burger King - Hyderabad, a recent Hygiene Rating audit rigorously assessed adherence to strict food safety and hygiene standards. The inspection covered key areas from ingredient receipt to meticulous cleanliness in food preparation zones. It also reviewed food storage practices to prevent contamination, emphasized staff adherence to personal hygiene protocols like proper handwashing and protective gear use, and ensured robust pest control measures. Documentation and training records were thoroughly checked to confirm staff were well-trained in hygiene protocols. This audit underscores Burger King - Hyderabad's commitment to maintaining exemplary hygiene standards for a safe dining environment."
        },
        
        {
            "img": "/images/gallery/img (3).jpeg",
            "text": "Auditors are conducting a detailed verification process at RMK Engineering College to ensure compliance with FIFO (First In, First Out) and FEFO (First Expired, First Out) inventory management practices. This includes checking the accuracy and clarity of labels on all items. Additionally, they are verifying the authenticity and reliability of the vendors supplying these items to the college."
        },
        
        {
            "img": "/images/gallery/img (4).jpeg",
            "text": "During Eat Right Place of Worship audits, thorough label checks are crucial. Inspectors verify the accuracy of ingredient listings, nutritional information, expiration dates, and allergen warnings, along with other required details. Proper labeling is essential as it enhances consumer awareness and fosters trust in the safety and quality of the food provided."
        },
        
        {
            "img": "/images/gallery/img (5).jpeg",
            "text": "Officials from the Central and State Food Safety Departments recently inspected the Balkampet Ellamma and Pochamma Devasthan. They evaluated the temple premises, including the kitchen and storage areas used for preparing prasads, focusing on overall cleanliness. Auditor Kasturi from Unavar Food Inspection and Certification Private Limited, alongside Greater Hyderabad Food Safety Officer Maulika, conducted these inspections on behalf of the Central Government's Food Safety Department. Evo Annapurna provided detailed explanations about the safety, cleanliness, and quality measures implemented for prasads at the temple. The Food Safety officials, Anam Taran, expressed their satisfaction with the cleanliness and safety standards maintained at the temple."
        },
        
        {
            "img": "/images/gallery/img (6).jpeg",
            "text": "Executive Director, Mr. Vivekanand Chandrasekaran, was invited to Christ University in Bangalore, where he delivered an insightful guest lecture on 'Recent Trends and Updates in FSSAI.' His presentation covered the latest developments and regulatory updates from the Food Safety and Standards Authority of India (FSSAI), highlighting the impact on food safety practices and industry standards. The faculty at Christ University honored Mr. Chandrasekaran for his valuable contribution, recognizing his expertise and the importance of staying informed on current trends in food safety regulations."
        },
        
        {
            "img": "/images/gallery/img (7).jpeg",
            "text": "Executive Director, Mr. Vivekanand Chandrasekaran, was invited to Christ University in Bangalore, where he delivered an insightful guest lecture on 'Recent Trends and Updates in FSSAI.' His presentation covered the latest developments and regulatory updates from the Food Safety and Standards Authority of India (FSSAI), highlighting the impact on food safety practices and industry standards. The faculty at Christ University honored Mr. Chandrasekaran for his valuable contribution, recognizing his expertise and the importance of staying informed on current trends in food safety regulations."
        },
        
        {
            "img": "/images/gallery/img (8).jpeg",
            "text": " Our Executive Director, Mr. Vivekanand Chandrasekaran, was invited to attend the grand launch event of Enviro Care Labs in Goa. He actively participated in this prestigious occasion, marking a significant milestone for Enviro Care Labs. The event, celebrated as one of the biggest launches in the industry, highlighted Mr. Vivekanand Chandrasekaran's influential presence and underscored the importance of this new venture in advancing environmental and food safety standards."
        },
        
        {
            "img": "/images/gallery/img (9).jpeg",
            "text": "Our Executive Director, Mr. Vivekanand Chandrasekaran, participated in the World Food Day 2022 event held at SRM Institute of Science and Technology. During this event, he conducted an informative workshop on the Basic Food Safety Program, sharing valuable insights and best practices in food safety. His contributions and expertise were highly appreciated, and he was honored by the faculty members of SRM for his significant role in promoting food safety education."
        },
        
        {
            "img": "/images/gallery/img (10).jpeg",
            "text": "Our Executive Director, Mr. Vivekanand Chandrasekaran, participated in the World Food Day 2022 event held at SRM Institute of Science and Technology. During this event, he conducted an informative workshop on the Basic Food Safety Program, sharing valuable insights and best practices in food safety. His contributions and expertise were highly appreciated, and he was honored by the faculty members of SRM for his significant role in promoting food safety education."
        },
        
        {
            "img": "/images/gallery/img (11).jpeg",
            "text": "Our Executive Director, Mr. Vivekanand Chandrasekaran, participated in the World Food Day 2022 event held at SRM Institute of Science and Technology. During this event, he conducted an informative workshop on the Basic Food Safety Program, sharing valuable insights and best practices in food safety. His contributions and expertise were highly appreciated, and he was honored by the faculty members of SRM for his significant role in promoting food safety education."
        },
        {
            "img": "/images/gallery/img (12).jpeg",
            "text": "Our organization prides itself on a highly qualified and dedicated team of professionals committed to ensuring the highest standards of food safety and hygiene. We employ over 12 full-time Hygiene Rating Auditors, all certified by the Food Safety and Standards Authority of India (FSSAI) and the Quality Council of India (QCI). Additionally, our team includes more than 6 full-time Lead Auditors who are certified in ISO 22000:2018, the international standard for food safety management systems. Together, our team brings extensive expertise and a deep commitment to maintaining and enhancing food safety protocols across various sectors."
        },
        {
            "img": "/images/gallery/img (13).jpeg",
            "text": "The GRT Thoothukudi kitchen underwent a comprehensive inspection to assess food safety and hygiene standards. The evaluation concentrated on several key areas, such as maintaining overall cleanliness, ensuring proper food storage practices, upholding personal hygiene standards, and implementing effective pest control measures. Additionally, the inspection included a detailed review of documentation and training records to verify compliance with established safety protocols."
        },
        {
            "img": "/images/gallery/img (14).jpeg",
            "text": "Description of image 1"
        },
        
        {
            "img": "/images/gallery/img (15).jpeg",
            "text": "We are delighted to share a proud moment for Unavar Food Inspection and Certification. Our Executive Director actively participated in the annual meet of the Quality Council of India (QCI) for IS17020 held in Delhi. This event showcased our commitment to maintaining high standards in inspection and certification processes, and it provided an opportunity for us to engage with industry leaders and experts in quality assurance. Our participation underscores our dedication to excellence and continuous improvement in food safety and inspection practices."
        }
        
    ]
}